Masmiseim36/nxpSDK/boards/evkmimxrt1020/demo_apps/mc_pmsm/pmsm_enc/pin_mux.h
/*
 * Copyright 2016, Freescale Semiconductor, Inc.
 * Copyright 2016-2019 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/***********************************************************************************************************************
 * Definitions
 **********************************************************************************************************************/

/*! @brief Direction type  */
typedef enum _pin_mux_direction
{
  kPIN_MUX_DirectionInput = 0U,         /* Input direction */
  kPIN_MUX_DirectionOutput = 1U,        /* Output direction */
  kPIN_MUX_DirectionInputOrOutput = 2U  /* Input or output direction */
} pin_mux_direction_t;

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

/* GPIO_AD_B1_13 (number 76), CAN_STBY/J18[4] */
#define BOARD_INITADC_CAN_STBY_PERIPHERAL                                   ADC1   /*!< Device name: ADC1 */
#define BOARD_INITADC_CAN_STBY_SIGNAL                                         IN   /*!< ADC1 signal: IN */
#define BOARD_INITADC_CAN_STBY_CHANNEL                                       13U   /*!< ADC1 IN channel: 13 */


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitADC(void);

/* GPIO_AD_B1_09 (number 81), UART_RX/J17[1] */
#define BOARD_INITENC_Trigger_PERIPHERAL                                   XBARA   /*!< Device name: XBARA */
#define BOARD_INITENC_Trigger_SIGNAL                                          IN   /*!< XBARA signal: IN */
#define BOARD_INITENC_Trigger_CHANNEL                                        13U   /*!< XBARA IN channel: 13 */


/*!
 *
 */
void BOARD_InitENC(void);

/* GPIO_AD_B0_07 (number 101), UART1_RXD/J17[4] */
#define BOARD_INITLPUART_UART1_RXD_PERIPHERAL                            LPUART1   /*!< Device name: LPUART1 */
#define BOARD_INITLPUART_UART1_RXD_SIGNAL                                     RX   /*!< LPUART1 signal: RX */


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitLPUART(void);

/* GPIO_AD_B0_14 (number 94), ENET_TXD0/U11[24]/J17[7] */
#define BOARD_INITPWM_ENET_TXD0_PERIPHERAL                                  PWM2   /*!< Device name: PWM2 */
#define BOARD_INITPWM_ENET_TXD0_SIGNAL                                         A   /*!< PWM2 signal: A */
#define BOARD_INITPWM_ENET_TXD0_CHANNEL                                       0U   /*!< PWM2 A channel: 0 */

/* GPIO_AD_B0_12 (number 96), ENET_RXER/U11[20]/J19[4] */
#define BOARD_INITPWM_ENET_RXER_PERIPHERAL                                  PWM2   /*!< Device name: PWM2 */
#define BOARD_INITPWM_ENET_RXER_SIGNAL                                         A   /*!< PWM2 signal: A */
#define BOARD_INITPWM_ENET_RXER_CHANNEL                                       1U   /*!< PWM2 A channel: 1 */

/* GPIO_AD_B0_10 (number 98), ENET_RXD0/U11[16]/J19[6] */
#define BOARD_INITPWM_ENET_RXD0_PERIPHERAL                                  PWM2   /*!< Device name: PWM2 */
#define BOARD_INITPWM_ENET_RXD0_SIGNAL                                         A   /*!< PWM2 signal: A */
#define BOARD_INITPWM_ENET_RXD0_CHANNEL                                       2U   /*!< PWM2 A channel: 2 */

/* GPIO_AD_B0_15 (number 93), ENET_TXD1/U11[25]/J19[2] */
#define BOARD_INITPWM_ENET_TXD1_PERIPHERAL                                  PWM2   /*!< Device name: PWM2 */
#define BOARD_INITPWM_ENET_TXD1_SIGNAL                                         B   /*!< PWM2 signal: B */
#define BOARD_INITPWM_ENET_TXD1_CHANNEL                                       0U   /*!< PWM2 B channel: 0 */

/* GPIO_AD_B0_13 (number 95), ENET_TXEN/U11[23]/J19[5] */
#define BOARD_INITPWM_ENET_TXEN_PERIPHERAL                                  PWM2   /*!< Device name: PWM2 */
#define BOARD_INITPWM_ENET_TXEN_SIGNAL                                         B   /*!< PWM2 signal: B */
#define BOARD_INITPWM_ENET_TXEN_CHANNEL                                       1U   /*!< PWM2 B channel: 1 */

/* GPIO_AD_B0_11 (number 97), ENET_CRS_DV/U11[18]/J19[3] */
#define BOARD_INITPWM_ENET_CRS_DV_PERIPHERAL                                PWM2   /*!< Device name: PWM2 */
#define BOARD_INITPWM_ENET_CRS_DV_SIGNAL                                       B   /*!< PWM2 signal: B */
#define BOARD_INITPWM_ENET_CRS_DV_CHANNEL                                     2U   /*!< PWM2 B channel: 2 */


/*!
 *
 */
void BOARD_InitPWM(void);

/* GPIO_AD_B0_09 (number 99), ENET_RXD1/U11[15]/J17[3] */
#define BOARD_MISC_ENET_RXD1_GPIO                                          GPIO1   /*!< GPIO device name: GPIO1 */
#define BOARD_MISC_ENET_RXD1_PORT                                          GPIO1   /*!< PORT device name: GPIO1 */
#define BOARD_MISC_ENET_RXD1_PIN                                              9U   /*!< GPIO1 pin index: 9 */


/*!
 *
 */
void BOARD_Misc(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
